package org.example.decorator

/**
 * Інтерфейс `SerialApi` описує базовий набір функціональності для взаємодії з серійним портом.
 * Це включає в себе можливість відправки та отримання даних, а також отримання інформації про швидкість передачі даних.
 */
interface SerialApi {
    /**
     * Відправляє дані через серійний порт.
     *
     * @param data Масив байт, який необхідно відправити.
     */
    fun send(data: ByteArray)

    /**
     * Отримує дані, які були прийняті через серійний порт.
     *
     * @return Масив байт отриманих даних.
     */
    fun receive(): ByteArray

    /**
     * Повертає швидкість передачі даних серійного порта.
     *
     * @return Швидкість в бодах (біт за секунду).
     */
    fun getSpeed(): Int
}
