package org.example.facade

// Оголошення переліку (enum) `UpdateChannel`, який представляє канали оновлень програмного забезпечення.
// Це дозволяє розробникам легко управляти версіями програмного забезпечення та їх розгортанням.
enum class UpdateChannel {
    // Канал RELEASE призначений для стабільних, офіційно випущених версій програмного забезпечення.
    // Ці оновлення проходять повне тестування і призначені для широкої аудиторії користувачів.
    RELEASE,

    // Канал RC (Release Candidate) використовується для останніх тестових версій перед офіційним випуском.
    // Версії в цьому каналі майже стабільні, але потребують додаткового тестування на помилки, які могли бути пропущені.
    RC,

    // Канал DEV призначений для розробників і включає найостанніші розробки та експериментальні функції.
    // Ці оновлення можуть бути нестабільними і містити помилки, тому вони призначені для раннього виявлення проблем і тестування нових ідей.
    DEV
}
